sohtamei/arduino-BLEPeripheral/src/nRF52832.cpp
  return (sd_ble_gap_tx_power_set(role, handle, txPower) == NRF_SUCCESS);
}

void nRF52832::startAdvertising() {
#ifdef NRF_DEBUG
  Serial.println(F("Start advertisement"));
#endif

  ble_gap_adv_params_t advertisingParameters;

  memset(&advertisingParameters, 0x00, sizeof(advertisingParameters));

  advertisingParameters.properties.type = this->_connectable ? BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED : ( this->_hasScanData ? BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED : BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED );
  advertisingParameters.p_peer_addr = NULL;
  advertisingParameters.filter_policy = BLE_GAP_ADV_FP_ANY;
  advertisingParameters.primary_phy = BLE_GAP_PHY_AUTO;
  advertisingParameters.secondary_phy = BLE_GAP_PHY_AUTO;
  advertisingParameters.interval    = (this->_advertisingInterval * 16) / 10; // advertising interval (in units of 0.625 ms)
  advertisingParameters.duration    = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED; // BLE_GAP_ADV_TIMEOUT_LIMITED_MAX;  // 
  advertisingParameters.max_adv_evts                = 0; // infinite advertisment
  advertisingParameters.scan_req_notification = 0;

  ble_gap_adv_data_t m_adv_data;
  m_adv_data.adv_data.p_data = this->_advData;
  m_adv_data.adv_data.len = this->_advDataLen;
  m_adv_data.scan_rsp_data.p_data = NULL;
  m_adv_data.scan_rsp_data.len    = 0;
    
  sd_ble_gap_adv_set_configure(&_adv_handle, &m_adv_data, &advertisingParameters);

  uint8_t conf_tag = BLE_CONN_CFG_TAG_DEFAULT;

  this->setTxPower(BLE_GAP_TX_POWER_ROLE_ADV, _adv_handle, 0);
  sd_ble_gap_adv_start(_adv_handle, conf_tag);

}

void nRF52832::disconnect() {
  sd_ble_gap_disconnect(this->_connectionHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void nRF52832::requestAddress() {
  ble_gap_addr_t gapAddress;

  sd_ble_gap_addr_get(&gapAddress);

  if (this->_eventListener) {
    this->_eventListener->BLEDeviceAddressReceived(*this, gapAddress.addr);
  }
}

void nRF52832::requestTemperature() {
#ifndef __RFduino__
  int32_t rawTemperature = 0;

  sd_temp_get(&rawTemperature);

  float temperature = rawTemperature / 4.0;

  if (this->_eventListener) {
    this->_eventListener->BLEDeviceTemperatureReceived(*this, temperature);
  }
#endif
}

void nRF52832::requestBatteryLevel() {
}

void nRF52832::faultHandler(uint32_t id, uint32_t pc, uint32_t info) {
    Serial.println(F("*** nRF52840 SD faultHandler"));
    PRINT_ERROR(id);
    NVIC_SystemReset();
}

#endif
